export default {
  "guide": "Руководство",
  "components": "Компоненты",
  "about": "О проекте",
  "search": "Поиск",
  "attributes": "Атрибуты",
  "slots": "Слоты",
  "variables": "Переменные",
  "exposes": "Expose",
  "right-aside-title": "Содержание",
  "name": "Название",
  "events": "События",
  "description": "Описание",
  "type": "Тип",
  "default": "По умолчанию",
  "basic": "Основное",
  "data": "Данные",
  "feedback": "Обратная связь",
  "form": "Форма",
  "navigation": "Навигация",
  "other": "Прочее",
  "top-bar": {
    "menu": "Меню",
    "nav": "Навигация",
  },
  "overview": {
    "basic-usage": "Основное использование",
    "one": "Один",
    "two": "Два",
    "three": "Три",
    "four": "Четыре",
    "disabled": "Отключено",
    "disabled-thin": "Отключено",
    "thick": "Толстый",
    "default": "По умолчанию",
    "thin": "Тонкий",
    "i-am-ripple": "Я рябь",
    "i-am-ripple-with-hover-bg": "Я рябь с фоновым изменением при наведении",
    "i-am-not-ripple": "Я не рябь",
    "circle": "Круг",
    "round": "Круглый",
    "square": "Квадрат",
    "transparent": "Прозрачный",
    "date": "Дата",
    "dates": "Даты",
    "date-range": "Диапазон дат",
    "summer": "Лето",
    "load-error": "Ошибка загрузки",
    "custom-loading-text": "Пользовательский текст загрузки",
    "download-in-progress": "Загрузка в процессе",
    "show": "Показать",
    "edit": "Редактировать",
    "check": "Проверить",
    "without-underline": "Без подчеркивания",
    "underlined": "Подчеркнутый",
    "selected-page": "Выбранная страница:",
    "loading": "Загрузка...",
    "i-am-slot-prefix": "Я префикс слота",
    "add": "Добавить",
    "remove": "Удалить",
    "animated": "Анимированный",
    "loading-state": "Состояние загрузки",
    "value": "значение:",
    "sort-values": "Сортировать значения",
    "custom-label": "Пользовательская метка",
    "custom-content-for": "пользовательский контент для",
    "tag-zero": "тег ноль",
    "tag-one": "тег один",
    "tag-two": "тег два",
    "i-am-disabled": "Я отключен",
    "enter-text": "Введите текст",
    "model-text": "Текст модели:",
    "explore-components": "Обзор компонентов",
    "button": {
      "style-type": {
        "subtitle": "Используйте *default* или *transparent* для определения базового стиля"
      },
      "loading": {
        "subtitle": "Используйте *boolean*, чтобы включить или отключить значок загрузки"
      },
      "ripple": {
        "subtitle": "Используйте *boolean*, чтобы включить или отключить эффект ряби при нажатии"
      },
      "height": {
        "subtitle": "Установите высоту, доступны значения *thick*, *default*, *thin*"
      },
      "disabled": {
        "subtitle": "Используйте *boolean*, чтобы отключить кнопку"
      },
      "shape": {
        "info": {
          "title": "Информация",
          "content": "При использовании round или square размер изменяется с помощью переменной --height"
        },
        "subtitle": "Используйте shape, чтобы изменить радиус границы кнопки"
      },
      "api": {
        "type": "Тип стандартной кнопки",
        "text": "Текст кнопки",
        "loading": "Включить/отключить загрузчик внутри кнопки",
        "style-type": "Изменить стиль кнопки",
        "accent-bg-on-hover": "Включить/отключить цвет фона при наведении",
        "ripple": "Включить/отключить волны при нажатии",
        "fill": "Заполнение контейнера кнопкой",
        "disabled": "Отключить кнопку",
        "height": "Изменить высоту кнопки",
        "shape": "Изменить форму",
        "icon": "Установить значок из списка значков"
      },
      "slot": {
        "default": "Настроить содержимое кнопки",
        "append": "Добавить свое пользовательское содержимое"
      },
      "variables": {
        "height": "Определить высоту кнопки"
      },
      "exposes": {
        "buttonDOMElement": "Оригинальный DOM элемент кнопки"
      }
    },
    "icon": {
      "search-icon": "Иконка поиска",
      "size": {
        "subtitle": "Задайте размер иконки."
      },
      "width-height": {
        "subtitle": "Определите ширину и высоту иконки."
      },
      "color": {
        "subtitle": "Установите цвет иконки. Вы можете использовать пользовательские цвета или передать доступную переменную."
      },
      "api": {
        "size": "Определяет общий размер иконки.",
        "width": "Устанавливает ширину иконки.",
        "height": "Устанавливает высоту иконки.",
        "color": "Определяет цвет иконки.",
        "icon": "Задает иконку из доступного списка иконок."
      },
      "slot": {
        "default": "Слот для настройки содержимого иконки по умолчанию."
      },
      "variables": {
        "color": "Определяет цвет иконки по умолчанию."
      }
    },
    "link": {
      "type": {
        "subtitle": "Выберите тип цвета: *accent*, *success*, *error*, *warning*"
      },
      "underline": {
        "subtitle": "Подчеркивание ссылки"
      },
      "disabled": {
        "subtitle": "Неактивное состояние ссылки"
      },
      "icon-name": {
        "subtitle": "Ссылка с иконкой"
      },
      "api": {
        "type": "Тип цвета",
        "href": "Нативный атрибут href",
        "underline": "Показывать подчеркивание при наведении",
        "icon-name": "Список иконок",
        "target": "Нативный атрибут target",
        "disabled": "Отключить ссылку"
      },
      "slot": {
        "default": "Настройка содержимого ссылки",
        "prepend": "Добавить пользовательское содержимое в начало"
      },
      "variables": {
        "link-color": "Цвет ссылки"
      }
    },
    "scroll": {
      "height": {
        "subtitle": "Используйте свойство *height*, чтобы задать высоту контейнера. Без установки высоты прокрутка не будет активирована."
      },
      "max-height": {
        "subtitle": "Прокрутка отображается только в случае, если высота элемента превышает максимальную высоту."
      },
      "value": {
        "subtitle": "Привязка и обновление значения модели для изменения позиции прокрутки."
      },
      "horizontal-scroll": {
        "subtitle": "Если ширина элемента превышает ширину области прокрутки, появляется горизонтальная полоса прокрутки."
      },
      "api": {
        "height": "Задает высоту контейнера прокрутки, поддерживает как статические, так и динамические значения.",
        "max-height": "Устанавливает максимальную высоту контейнера прокрутки, ограничивая его вертикальный размер.",
        "model-value": "Содержит текущую позицию прокрутки, используется для двусторонней привязки и управления прокруткой.",
        "scroll-y-prop": "Определяет вертикальное поведение прокрутки, например *auto* или *hidden*.",
        "scroll-x-prop": "Задает горизонтальное поведение прокрутки, контролируя видимость и функциональность горизонтальной прокрутки.",
        "css-scroll-behavior": "Определяет поведение анимации прокрутки, например *smooth* для плавной прокрутки.",
        "scroll-end-delay": "Задержка до окончания прокрутки в миллисекундах.",
        "update-only-on-scroll-end": "При установке в *true* обновляет значение модели только после завершения прокрутки.",
        "y-bar-width-in-px": "Ширина вертикальной полосы прокрутки.",
        "x-bar-width-in-px": "Ширина горизонтальной полосы прокрутки.",
        "y-gap-in-px": "Отступ содержимого для вертикальной полосы прокрутки.",
        "x-gap-in-px": "Отступ содержимого для горизонтальной полосы прокрутки.",
        "role": "Роль представления.",
        "aria-label": "Атрибут *aria-label* для представления.",
        "aria-orientation": "Атрибут *aria-orientation* для представления."
      },
      "slot": {
        "default": "Содержимое для прокрутки"
      },
      "variables": {
        "thumb-color": "Цвет ползунка"
      },
      "exposes": {
        "scrollDOMContainer": "Элемент контейнера",
        "moveTo": "Функция для передачи новых координат"
      },
      "events": {
        "update:model-value": "Событие для перехвата двусторонней привязки.",
        "on-scroll-end": "Событие, возникающее после окончания анимации прокрутки.",
        "on-scroll": "Событие прокрутки."
      }
    },
    "avatar": {
      "size": {
        "subtitle": "Задает размер аватара, принимает только значение типа *number*."
      },
      "shape": {
        "subtitle": "Определяет форму аватара. Может быть *circle* или *square*."
      },
      "fit": {
        "subtitle": "Определяет, как изображение помещается в контейнер."
      },
      "api": {
        "size": "Задает размер аватара.",
        "shape": "Определяет форму аватара.",
        "src": "URL изображения аватара.",
        "src-set": "Список источников изображения.",
        "alt": "Текстовое описание изображения.",
        "fit": "Определяет, как изображение заполняет контейнер."
      },
      "slot": {
        "error": "Слот для отображения ошибок загрузки"
      },
      "events": {
        "error": "Событие ошибки загрузки изображения.",
        "load": "Событие успешной загрузки изображения."
      }
    },
    "badge": {
      "value": {
        "subtitle": "Отображаемое значение на бейдже, может быть *строкой* или *числом*."
      },
      "max": {
        "subtitle": "Максимальное значение для бейджа. Если оно превышено, отображается как *max+*."
      },
      "is-dot": {
        "subtitle": "Отображает бейдж в виде маленькой точки, если установлено в *true*."
      },
      "hidden": {
        "subtitle": "Управляет отображением бейджа."
      },
      "color": {
        "subtitle": "Цвет фона бейджа."
      },
      "offset": {
        "subtitle": "Горизонтальное/вертикальное смещение бейджа относительно родительского элемента."
      },
      "api": {
        "value": "Отображаемое значение на бейдже.",
        "max": "Максимальное отображаемое значение.",
        "is-dot": "Отображает бейдж в виде точки.",
        "hidden": "Скрывает бейдж.",
        "color": "Устанавливает цвет фона бейджа.",
        "offset-y": "Вертикальное смещение бейджа.",
        "offset-x": "Горизонтальное смещение бейджа."
      },
      "slot": {
        "default": "Относительное содержимое для бейджа"
      },
      "variables": {
        "dot-size": "Ширина и высота точки"
      }
    },
    "card": {
      "shadow-type": {
        "subtitle": "Определяет тип тени для карточки. Принимает значения, такие как *всегда*, *при наведении* или *никогда*."
      },
      "api": {
        "shadow-type": "Определяет видимость тени на карточке."
      },
      "slot": {
        "header": "Заголовок карточки",
        "footer": "Нижний колонтитул карточки"
      },
      "variables": {
        "card-padding": "Отступ для всех краев"
      }
    },
    "image": {
      "fit": {
        "subtitle": "Определяет, как изображение вписывается в контейнер. Принимает значения, такие как *fill*, *contain*, *cover*, *none*, *scale-down*.",
        "info": {
          "title": "Информация",
          "content": "Чтобы свойство fit отображалось корректно, убедитесь, что у контейнера задан ограниченный размер"
        }
      },
      "close-on-outside-click": {
        "subtitle": "Закрывает предпросмотр изображения при нажатии снаружи, если установлено в *true*."
      },
      "alt": {
        "subtitle": "Альтернативный текст для изображения, когда оно не может быть отображено."
      },
      "loading-text": {
        "subtitle": "Текст, отображаемый во время загрузки изображения."
      },
      "load-failed-text": {
        "subtitle": "Текст, отображаемый при неудачной загрузке изображения."
      },
      "api": {
        "fit": "Определяет, как изображение должно вписываться в контейнер.",
        "close-on-outside-click": "Закрывает предпросмотр при нажатии снаружи.",
        "alt": "Текстовое описание для изображения.",
        "loading-text": "Текст, отображаемый во время загрузки изображения.",
        "load-failed-text": "Текст, отображаемый при неудачной загрузке изображения.",
        "frame-border": "Определяет толщину рамки",
        "image-padding": "Определяет отступ изображения",
        "src": "URL изображения.",
        "src-set": "Список источников изображения."
      },
      "slot": {
        "loading": "Слот для пользовательского содержимого, отображаемого во время загрузки изображения.",
        "error": "Слот для пользовательского содержимого, отображаемого при неудачной загрузке изображения."
      },
      "variables": {
        "width": "Определяет ширину изображения.",
        "height": "Определяет высоту изображения.",
        "background-color": "Определяет цвет фона изображения"
      },
      "events": {
        "error": "Событие ошибки изображения",
        "load": "Событие загрузки изображения"
      }
    },
    "tag-list": {
      "api": {
        "model-value": "Список объектов элементов тега"
      },
      "events": {
        "update:model-value": "Событие для перехвата двусторонней привязки",
        "close": "Возвращает значение закрытого тега"
      }
    },
    "tag-item": {
      "value": {
        "subtitle": "Значение, назначенное компоненту, обычно *строка* или *число*."
      },
      "text": {
        "subtitle": "Определяет текстовое содержимое, отображаемое в компоненте."
      },
      "removable": {
        "subtitle": "Определяет, может ли компонент быть удален пользователем. Принимает только *boolean*.",
        "info": {
          "title": "Информация",
          "content": "Если вы хотите, чтобы отображение тега обрабатывалось автоматически, можно обернуть компонент в NmorphTagList."
        }
      },
      "height": {
        "subtitle": "Определяет высоту компонента."
      },
      "design": {
        "subtitle": "Если установлено в *common*, компонент будет отображен с границей."
      },
      "api": {
        "value": "Определяет значение для компонента.",
        "text": "Устанавливает текст, отображаемый внутри компонента.",
        "removable": "Определяет, может ли компонент быть удален. Работает автоматически при оборачивании в NmorphTagList.",
        "design": "Определяет стиль компонента.",
        "height": "Задает высоту компонента."
      },
      "events": {
        "close": "Возвращает значение закрытого тега."
      }
    },
    "skeleton": {
      "animated": {
        "subtitle": "Включает анимацию для компонента скелета, если установлено в *true*."
      },
      "loading": {
        "subtitle": "Управляет отображением скелета, обычно основываясь на состоянии загрузки."
      },
      "rows": {
        "subtitle": "Определяет количество строк в скелете, обычно для симуляции текстового содержимого."
      },
      "api": {
        "animated": "Переключает анимацию для компонента скелета.",
        "loading": "Определяет, отображается ли скелет на основе состояния загрузки.",
        "rows": "Задает количество строк в макете скелета."
      },
      "slot": {
        "template": "Слот для пользовательской структуры скелета при загрузке.",
        "default": "Содержимое слота по умолчанию, когда загрузка завершена."
      },
      "variables": {
        "loading-gradient": "Определяет цвет градиента, используемый во время анимации загрузки скелета."
      }
    },
    "skeleton-item": {
      "api": {
        "variant": "Определяет тип скелета для отображения, например, текст или круг.",
        "design": "Устанавливает дизайн элемента скелета, такой как цвет или границы.",
        "width": "Задает ширину элемента скелета."
      }
    },
    "progress": {
      "type": {
        "subtitle": "Определяет тип индикатора прогресса, например, *линейный* или *круговой*."
      },
      "color": {
        "subtitle": "Устанавливает цвет индикатора прогресса."
      },
      "percentage": {
        "subtitle": "Определяет процент завершенного прогресса.",
        "info": {
          "title": "Информация",
          "content": "Убедитесь, что задана ширина контейнера-обертки для корректного отображения."
        }
      },
      "value-inside": {
        "subtitle": "Отображает текст прогресса внутри полосы, если установлено в *true*."
      },
      "value-right-side": {
        "subtitle": "Показывает или скрывает текст с процентом рядом с индикатором прогресса."
      },
      "indeterminate": {
        "subtitle": "Отображает анимацию неопределенного прогресса при значении *true*."
      },
      "circle-size": {
        "subtitle": "Определяет размер кругового индикатора прогресса."
      },
      "api": {
        "type": "Указывает тип индикатора прогресса.",
        "color": "Задает цвет индикатора прогресса.",
        "percentage": "Устанавливает процентное значение прогресса.",
        "value-inside": "Отображает текст прогресса внутри полосы.",
        "value-right-side": "Показывает или скрывает текст с процентом.",
        "indeterminate": "Включает анимацию неопределенного прогресса.",
        "circle-size": "Задает размер кругового индикатора прогресса."
      },
      "slot": {
        "inner-text": "Слот для пользовательского контента внутри индикатора прогресса.",
        "right-side": "Слот для пользовательского контента справа от индикатора прогресса.",
        "circle-inner-part": "Слот для пользовательского контента внутри кругового индикатора."
      },
      "variables": {
        "height": "Определяет высоту индикатора прогресса.",
        "width-transition": "Устанавливает анимацию изменения ширины.",
        "animation": "Контролирует настройки анимации индикатора прогресса."
      }
    },
    "calendar": {
      "type": {
        "subtitle": "Определяет тип календаря, например, *одиночный* или *множественный* выбор."
      },
      "custom-content": {
        "subtitle": ""
      },
      "range": {
        "subtitle": "Определяет, работает ли календарь в режиме выбора диапазона."
      },
      "api": {
        "mark-today": "Подсвечивает сегодняшнюю дату.",
        "initial-date": "Устанавливает начальную дату, отображаемую в календаре.",
        "model-value": "Представляет выбранную дату (даты) в календаре.",
        "type": "Определяет тип выбора в календаре.",
        "range": "Включает режим выбора диапазона в календаре, позволяя выбирать диапазон дат."
      },
      "slot": {
        "header": "Слот для настройки заголовка календаря.",
        "content": "Слот для настройки содержимого календаря."
      },
      "variables": {
        "table-data-cell-height": "Определяет высоту каждой ячейки даты в календаре."
      }
    },
    "image-preview": {
      "model-value": {
        "subtitle": "Контролирует видимость предпросмотра изображения."
      },
      "initial-index": {
        "subtitle": "Определяет начальный индекс изображения, если присутствует несколько изображений."
      },
      "src": {
        "subtitle": "URL-адрес изображения для предпросмотра."
      },
      "api": {
        "model-value": "Булево значение, которое переключает видимость предпросмотра изображения.",
        "alt": "Альтернативный текст, описывающий изображение, когда оно не может быть загружено.",
        "initial-index": "Индекс первого изображения, отображаемого в наборе изображений.",
        "src": "URL-адрес изображения для предпросмотра.",
        "scale-step": "Шаг увеличения (масштабирования) изображения.",
        "min-scale-level": "Определяет минимальный уровень масштабирования для изображения.",
        "max-scale-level": "Определяет максимальный уровень масштабирования для изображения."
      },
      "slot": {},
      "variables": {
        "width": "Определяет ширину предпросмотра изображения.",
        "height": "Определяет высоту предпросмотра изображения."
      },
      "events": {
        "update:model-value": "Событие для перехвата двусторонней привязки"
      }
    },
    "pagination": {
      "basic-usage": {
        "subtitle": "Основное использование компонента пагинации, позволяющее навигацию между страницами."
      },
      "api": {
        "total-elements-quantity": "Общее количество элементов для пагинации.",
        "model-value": "Текущий активный номер страницы.",
        "elements-quantity-on-page": "Количество элементов, отображаемых на каждой странице.",
        "disabled": "Булево значение, отключающее компонент пагинации.",
        "hide-on-single-page": "Скрывает компонент пагинации, если есть только одна страница.",
        "max-visible-pages": "Определяет, сколько страниц отображается в элементе управления пагинацией.",
        "fast-forward-step": "Определяет, сколько страниц пропускается при быстрой перемотке вперед."
      },
      "slot": {},
      "variables": {},
      "events": {
        "update:model-value": "Вызывается при изменении текущего номера страницы."
      }
    },
    "table": {
      "basic-usage": {
        "subtitle": "",
        "enable-row-highlight": "Включить выделение строки при наведении",
        "disable-row-highlight": "Отключить выделение строки при наведении",
        "click-me-text": "Нажми на меня!",
        "info": {
          "title": "Важная информация",
          "content": "Свойство 'bordered' работает только если свойство 'design' установлено в 'common'. Кроме того, сортировка в настоящее время работает только с двумя значениями: 'ascending' и 'descending'.\nОбратите внимание, что таблица находится в стадии активной разработки и может содержать ошибки."
        }
      },
      "api": {
        "data": "Определяет данные, которые будут отображены в таблице.",
        "row-hover": "Булево значение, которое включает или отключает эффект наведения на строки таблицы.",
        "bordered": "Булево значение, которое включает или отключает границы вокруг ячеек таблицы. Работает только если свойство 'design' установлено в 'common'.",
        "sort": "Определяет поведение сортировки для столбцов таблицы.",
        "design": "Позволяет настроить стили таблицы."
      },
      "slot": {},
      "variables": {
        "border-color": "Устанавливает цвет границы таблицы.",
        "table-cell-height": "Определяет высоту ячеек таблицы."
      }
    },
    "table-column": {
      "api": {
        "prop": "Указывает имя свойства из источника данных, которое будет отображаться в этом столбце.",
        "label": "Заголовок для столбца, отображаемый в заголовке таблицы.",
        "width": "Определяет ширину столбца в значении CSS.",
        "alignment": "Устанавливает выравнивание текста в столбце. Принимает значения 'left', 'center' или 'right'."
      }
    },
    "table-cell": {
      "api": {
        "row": "Обязательное свойство. Передает индекс строки из области видимости, представляя текущую строку, которая рендерится."
      },
      "slot": {
        "default": "Слот по умолчанию используется для настройки содержимого внутри каждой ячейки столбца. Обеспечивает доступ к данным строки и другим соответствующим свойствам области видимости."
      }
    },
    "tooltip": {
      "text": {
        "subtitle": "Содержимое, отображаемое внутри подсказки.",
        "hover-me": "Наведи на меня",
        "i-am-tooltip": "Я подсказка",
        "tooltip": "Подсказка",
        "button": "Кнопка"
      },
      "position": {
        "subtitle": "Определяет позицию подсказки относительно целевого элемента. Принимает значения, такие как 'top', 'bottom', 'left', 'right'."
      },
      "force-coordinate": {
        "subtitle": "Переопределяет стандартную логику позиционирования и позволяет указать точные координаты для подсказки."
      },
      "api": {
        "text": "Определяет текстовое содержимое подсказки.",
        "position": "Устанавливает положение подсказки относительно целевого элемента.",
        "force-show": "Булево значение, которое принудительно показывает подсказку.",
        "force-coordinate": "Позволяет вручную управлять координатами подсказки."
      },
      "slot": {},
      "variables": {
        "max-width": "Устанавливает максимальную ширину содержимого подсказки. Помогает предотвратить слишком широкую подсказку.",
        "width": "Устанавливает ширину содержимого подсказки. Позволяет контролировать горизонтальный размер подсказки.",
        "height": "Устанавливает высоту содержимого подсказки. Позволяет контролировать вертикальный размер подсказки."
      }
    },
    "alert": {
      "basic-usage": {
        "title": "Любой заголовок",
        "content": "Контент для оповещения",
        "info": {
          "title": "Дополнительная информация",
          "content": "Для удобного управления несколькими оповещениями используйте компонент 'NmorphNotificationProvider', который позволяет группировать и централизованно управлять оповещениями."
        }
      },
      "use-provider": {
        "subtitle": "Для использования провайдера необходимо импортировать хук из библиотеки."
      },
      "api": {
        "id": "Уникальный идентификатор для компонента оповещения.",
        "type": "Определяет тип оповещения (например, success, error, warning, info).",
        "closable": "Булево значение, определяющее, можно ли закрыть оповещение пользователем.",
        "title": "Текст заголовка, отображаемый в верхней части оповещения.",
        "content": "Основное сообщение или контент оповещения.",
        "fill": "Определяет, должно ли оповещение занимать всю ширину своего контейнера.",
        "max-width": "Максимальная ширина компонента оповещения.",
        "show-icon": "Булево значение, которое отображает иконку на основе типа оповещения.",
        "bordered": "Добавляет границу вокруг оповещения для выделения.",
        "html": "Позволяет использовать HTML-контент в теле оповещения. Используйте с осторожностью, чтобы избежать XSS-уязвимостей."
      },
      "slot": {
        "icon": "Слот для кастомизации иконки, отображаемой в оповещении.",
        "title": "Слот для кастомизации заголовка оповещения.",
        "default": "Слот для кастомизации основного содержимого оповещения."
      },
      "variables": {},
      "events": {
        "close": "Эмитируется, когда оповещение закрывается пользователем."
      }
    },
    "dialog": {
      "basic-usage": {
        "subtitle": "",
        "show-modal": "Показать модальное окно"
      },
      "api": {
        "model-value": "Булево значение, которое управляет видимостью диалога.",
        "title": "Определяет текст заголовка диалога.",
        "width": "Задает ширину диалогового окна.",
        "open-delay": "Задержка в миллисекундах перед открытием диалога.",
        "close-delay": "Задержка в миллисекундах перед закрытием диалога.",
        "close-on-click-modal": "Булево значение, позволяющее закрыть диалог при клике снаружи.",
        "show-close": "Булево значение, которое отображает кнопку закрытия в диалоге.",
        "z-index": "Определяет z-index для управления наложением диалога.",
        "close-on-overlay": "Булево значение, указывающее, следует ли закрывать диалог при клике на область оверлея."
      },
      "slot": {
        "header": "Слот для кастомизации содержимого заголовка диалога.",
        "default": "Слот для определения основного содержимого диалога."
      },
      "events": {
        "on-close": "Эмитируется, когда диалог закрывается пользователем.",
        "update:model-value": "Эмитируется при изменении видимости диалога."
      },
      "variables": {
        "width": "Определяет ширину компонента диалога."
      }
    },
    "divider": {
      "direction": {
        "subtitle": "Определяет направление разделителя. Принимает значения 'horizontal' или 'vertical'."
      },
      "api": {
        "direction": "Определяет ориентацию разделителя: 'horizontal' или 'vertical'."
      },
      "slot": {},
      "variables": {}
    },
    "overlay": {
      "basic-usage": {
        "subtitle": "",
        "show-default": "Показать по умолчанию",
        "show-transparent": "Показать прозрачный"
      },
      "api": {
        "show": "Управляет видимостью компонента. Установите значение *true*, чтобы показать его, *false*, чтобы скрыть.",
        "transparent": "Булево значение, которое делает фон компонента прозрачным, если включено."
      },
      "slot": {
        "default": "Слот по умолчанию для кастомизации содержимого внутри компонента."
      },
      "events": {
        "on-outside-click": "Эмитируется, когда пользователь кликает вне компонента."
      },
      "variables": {}
    },
    "notification-provider": {
      "notifications": {
        "subtitle": ""
      },
      "placement": {
        "subtitle": "Определяет позицию уведомлений на экране. Принимает значения, такие как 'top-right', 'bottom-left' и т.д."
      },
      "z-index": {
        "subtitle": "Задает z-index для уведомлений, чтобы контролировать их порядок наложения."
      },
      "quantity": {
        "subtitle": "Ограничивает максимальное количество уведомлений, которые могут отображаться одновременно."
      },
      "api": {
        "notifications": "Массив, содержащий уведомления для отображения.",
        "placement": "Указывает, где уведомления будут появляться на экране.",
        "z-index": "Определяет порядок наложения уведомлений.",
        "quantity": "Максимальное количество уведомлений, которое может быть на экране одновременно.",
        "close-icon-position": "Определяет расположение кнопки закрытия."
      },
      "slot": {},
      "variables": {}
    },
    "tabs": {
      "api": {
        "model-value": "Управляет активным состоянием компонента, обычно используется для привязки выбранного значения.",
        "stretch": "Булево значение, которое определяет, должен ли компонент растягиваться, чтобы заполнить доступное пространство."
      },
      "slot": {
        "default": "Слот для кастомизации содержимого внутри каждой вкладки."
      },
      "variables": {},
      "events": {
        "update:model-value": "Эмитируется при изменении активной вкладки.",
        "tab-change": "Эмитируется, когда пользователь меняет вкладку, указывая на новую активную вкладку."
      }
    },
    "tab-pane": {
      "api": {
        "label": "Текстовая метка для вкладки, отображаемая в навигации по вкладкам.",
        "name": "Уникальный идентификатор для вкладки, используется для управления активной вкладкой.",
        "disabled": "Булево значение, указывающее, отключена ли вкладка и не может быть выбрана."
      },
      "slot": {
        "label": "Слот для кастомизации метки вкладки.",
        "default": "Слот для определения основного содержимого вкладки."
      }
    },
    "dropdown": {
      "basic-usage": {
        "subtitle": "Управляет открытием или закрытием выпадающего списка. Установите значение *true*, чтобы открыть, *false*, чтобы закрыть.",
        "first-menu": "Первое меню",
        "second-menu": "Второе меню"
      },
      "api": {
        "open": "Булево значение, управляющее видимостью выпадающего списка.",
        "relative-element": "Определяет элемент, относительно которого будет позиционироваться выпадающий список.",
        "width": "Указывает ширину выпадающего списка.",
        "x-offset": "Горизонтальное смещение в пикселях для настройки позиции выпадающего списка.",
        "y-offset": "Вертикальное смещение в пикселях для настройки позиции выпадающего списка.",
        "fill-width": "Булево значение, определяющее, должен ли выпадающий список занимать всю ширину контейнера."
      },
      "slot": {
        "default": "Слот для кастомизации содержимого внутри выпадающего списка."
      },
      "variables": {},
      "events": {
        "on-outside-click": "Эмитируется, когда пользователь кликает вне выпадающего списка, что можно использовать для его закрытия."
      }
    },
    "backtop": {
      "basic-usage": {
        "info": {
          "title": "Информация",
          "content": "Убедитесь, что высота контейнера прокрутки определена."
        },
        "scroll-down": "Прокрутить вниз"
      },
      "api": {
        "right": "Задает расстояние от правого края экрана.",
        "bottom": "Задает расстояние от нижнего края экрана.",
        "visibility-height": "Определяет высоту прокрутки, при которой кнопка возврата наверх становится видимой. Принимает число в пикселях.",
        "design": "Обычный стиль или нейроморфный"
      },
      "slot": {
        "default": "Слот для кастомизации содержимого кнопки возврата наверх."
      },
      "events": {
        "click": "Эмитируется, когда пользователь кликает на кнопку возврата наверх."
      },
      "variables": {}
    },
    "breadcrumb": {
      "separator": {
        "subtitle": "Определяет символ, используемый для разделения элементов навигации."
      },
      "api": {
        "separator": "Указывает символ, разделяющий элементы навигации."
      }
    },
    "breadcrumb-item": {
      "api": {
        "to": "Указывает целевой маршрут для навигации. Принимает строку пути или объект маршрута.",
        "replace": "Булево значение, определяющее, должна ли навигация заменять текущую запись в истории вместо добавления новой."
      }
    },
    "text-input": {
      "height": {
        "subtitle": "Устанавливает высоту поля ввода."
      },
      "disabled": {
        "subtitle": "Отключает поле ввода, если установлено в *true*."
      },
      "type-password": {
        "subtitle": "Если установлено в *true*, текст в поле ввода будет скрыт как пароль.",
        "toggle": "Переключить тип"
      },
      "model-value": {
        "subtitle": "Представляет значение поля ввода, обычно используется для двустороннего связывания данных."
      },
      "clearable": {
        "subtitle": "Если установлено в *true*, появится кнопка для очистки поля ввода."
      },
      "api": {
        "height": "Определяет высоту текстового поля.",
        "disabled": "Булево значение, отключающее текстовое поле.",
        "placeholder": "Текст, отображаемый как подсказка, когда поле ввода пусто.",
        "type-password": "Булево значение, превращающее поле ввода в поле для пароля.",
        "model-value": "Текущее значение поля ввода.",
        "clearable": "Булево значение, добавляющее кнопку для очистки значения поля ввода."
      },
      "slot": {
        "prepend-icon": "Слот для добавления иконки в начало поля ввода."
      },
      "variables": {
        "prepend-icon-indent": "Определяет отступ для иконки перед вводом."
      },
      "events": {
        "update:model-value": "Эмитируется при изменении значения поля ввода.",
        "focus": "Эмитируется, когда поле ввода получает фокус.",
        "blur": "Эмитируется, когда поле ввода теряет фокус.",
        "on-enter": "Эмитируется при нажатии клавиши Enter."
      },
      "exposes": {
        "inputDOMRef": "Оригинальный элемент DOM поля ввода"
      }
    },
    "switch": {
      "height": {
        "subtitle": "Определяет высоту компонента переключателя."
      },
      "disabled": {
        "subtitle": "Отключает переключатель, если установлено в *true*."
      },
      "model-value": {
        "subtitle": "Управляет состоянием включено/выключено переключателя."
      },
      "loading": {
        "subtitle": "Отображает состояние загрузки на переключателе, если установлено в *true*."
      },
      "active-value": {
        "subtitle": "Указывает значение, когда переключатель включен."
      },
      "inactive-value": {
        "subtitle": "Указывает значение, когда переключатель выключен."
      },
      "api": {
        "height": "Указывает высоту переключателя.",
        "disabled": "Булево значение, отключающее компонент переключателя.",
        "model-value": "Управляет состоянием переключателя.",
        "loading": "Булево значение, показывающее индикатор загрузки на переключателе.",
        "active-value": "Значение, когда переключатель включен.",
        "inactive-value": "Значение, когда переключатель выключен."
      },
      "slot": {
        "bg-on": "Слот для кастомизации фона, когда переключатель включен.",
        "bg-off": "Слот для кастомизации фона, когда переключатель выключен.",
        "thumb-on": "Слот для кастомизации кнопки, когда переключатель включен.",
        "thumb-off": "Слот для кастомизации кнопки, когда переключатель выключен."
      },
      "variables": {
        "height": "Определяет высоту переключателя.",
        "offset": "Указывает смещение кнопки переключателя.",
        "thumb-height": "Определяет высоту кнопки переключателя."
      },
      "events": {
        "update:model-value": "Эмитируется, когда переключатель изменяет свое состояние."
      },
      "exposes": {
        "inputDOMRef": "Оригинальный элемент DOM поля ввода"
      }
    },
    "checkbox": {
      "id": {
        "subtitle": "Уникальный идентификатор для чекбокса."
      },
      "disabled": {
        "subtitle": "Отключает чекбокс, если установлено в *true*."
      },
      "model-value": {
        "subtitle": "Представляет состояние чекбокса (отмечен или нет).",
        "label": "Метка"
      },
      "label": {
        "subtitle": "Указывает текст метки для чекбокса."
      },
      "design": {
        "subtitle": "Определяет стиль дизайна чекбокса, например, стандартный или с контуром."
      },
      "api": {
        "id": "Уникальный идентификатор для чекбокса.",
        "disabled": "Булево значение, отключающее чекбокс.",
        "model-value": "Состояние чекбокса (отмечен или нет).",
        "label": "Метка, отображаемая рядом с чекбоксом.",
        "design": "Определяет стиль дизайна чекбокса."
      },
      "slot": {
        "default": "Слот для кастомизации содержимого чекбокса.",
        "label": "Слот для кастомизации метки чекбокса."
      },
      "variables": {
        "size": "Определяет размер чекбокса."
      },
      "events": {
        "update:model-value": "Эмитируется при изменении состояния чекбокса."
      },
      "exposes": {
        "inputDOMRef": "Оригинальный элемент DOM поля ввода"
      }
    },
    "checkbox-group": {
      "height": {
        "subtitle": "Указывает высоту контейнера группы чекбоксов."
      },
      "fill": {
        "subtitle": "Если установлено в *true*, контейнер заполнит доступное пространство."
      },
      "disabled": {
        "subtitle": "Отключает все чекбоксы в группе, если установлено в *true*."
      },
      "model-value": {
        "subtitle": "Массив выбранных значений в группе чекбоксов."
      },
      "options": {
        "subtitle": "Определяет опции для чекбоксов в группе."
      },
      "design": {
        "subtitle": "Задает стиль дизайна для группы чекбоксов."
      },
      "direction": {
        "subtitle": "Указывает направление (горизонтальное или вертикальное) для группы чекбоксов."
      },
      "api": {
        "height": "Высота контейнера группы чекбоксов.",
        "fill": "Булево значение, позволяющее контейнеру заполнить доступное пространство.",
        "disabled": "Отключает все чекбоксы в группе.",
        "model-value": "Массив выбранных значений.",
        "options": "Опции для чекбоксов.",
        "design": "Стиль дизайна группы чекбоксов.",
        "direction": "Направление расположения группы чекбоксов."
      },
      "slot": {
        "default": "Слот для кастомизации содержимого группы чекбоксов."
      },
      "variables": {},
      "events": {
        "update:model-value": "Эмитируется при изменении выбранных значений в группе чекбоксов."
      }
    },
    "autocomplete": {
      "basic-usage": {
        "placeholder": "Введите что-нибудь..."
      },
      "height": {
        "subtitle": "Определяет высоту поля ввода автодополнения."
      },
      "fill": {
        "subtitle": "Если установлено в *true*, поле автодополнения заполнит свой контейнер."
      },
      "disabled": {
        "subtitle": "Отключает поле автодополнения, если установлено в *true*."
      },
      "placeholder": {
        "subtitle": "Текст, отображаемый, когда поле ввода пустое."
      },
      "clearable": {
        "subtitle": "Если установлено в *true*, будет отображаться кнопка для очистки поля ввода."
      },
      "list": {
        "subtitle": "Задает список опций для предложений автодополнения."
      },
      "action-callback": {
        "subtitle": "Функция, вызываемая при выборе опции из списка."
      },
      "api": {
        "height": "Высота поля ввода автодополнения.",
        "fill": "Булево значение, позволяющее полю заполнить свой контейнер.",
        "disabled": "Отключает поле ввода автодополнения.",
        "model-value": "Текущее значение поля ввода.",
        "placeholder": "Подсказка, отображаемая, когда поле ввода пустое.",
        "clearable": "Булево значение, добавляющее кнопку для очистки значения поля.",
        "list": "Список предложений для ввода.",
        "action-callback": "Функция обратного вызова, вызываемая при выборе опции."
      },
      "slot": {
        "loader": "Слот для добавления кастомного загрузчика во время получения данных."
      },
      "variables": {},
      "events": {
        "update:model-value": "Эмитируется при изменении значения поля автодополнения.",
        "select": "Эмитируется при выборе предложения."
      }
    },
    "file-upload": {
      "model-value": {},
      "disabled": {
        "subtitle": "Отключает компонент загрузки файлов, если установлено в *true*."
      },
      "multiple": {
        "subtitle": "Позволяет загрузить несколько файлов, если установлено в *true*."
      },
      "allowed-types": {
        "subtitle": "Задает допустимые типы файлов для загрузки."
      },
      "photo-with-preview": {
        "subtitle": "Если установлено в *true*, загруженные фотографии будут отображаться с предварительным просмотром."
      },
      "fill": {
        "subtitle": "Если установлено в *true*, кнопка загрузки файлов заполнит контейнер."
      },
      "api": {
        "model-value": "Представляет загруженные файлы.",
        "disabled": "Булево значение, отключающее компонент загрузки файлов.",
        "multiple": "Булево значение, позволяющее выбрать несколько файлов.",
        "allowed-types": "Определяет типы файлов, которые можно загрузить.",
        "photo-with-preview": "Отображает предварительный просмотр загруженных изображений.",
        "fill": "Позволяет кнопке загрузки заполнить свой контейнер."
      },
      "slot": {
        "trigger": "Слот для кастомизации кнопки, инициирующей загрузку файла."
      },
      "variables": {},
      "events": {
        "on-unsupported-file-type-error": "Эмитируется, когда пользователь пытается загрузить неподдерживаемый тип файла.",
        "update:model-value": "Эмитируется при изменении выбора файлов."
      },
      "exposes": {
        "inputDOMRef": "Оригинальный элемент DOM поля ввода"
      }
    },
    "number-input": {
      "basic-usage": {
        "subtitle": "Представляет текущее числовое значение поля ввода."
      },
      "height": {
        "subtitle": "Определяет высоту числового поля ввода."
      },
      "fill": {
        "subtitle": "Если установлено в *true*, числовое поле ввода заполнит контейнер."
      },
      "disabled": {
        "subtitle": "Отключает числовое поле ввода, если установлено в *true*."
      },
      "max": {
        "subtitle": "Задает максимальное значение для ввода."
      },
      "min": {
        "subtitle": "Задает минимальное значение для ввода."
      },
      "step": {
        "subtitle": "Определяет шаг для увеличения или уменьшения значения."
      },
      "action-btn-position-right": {
        "subtitle": "Если установлено в *true*, кнопки увеличения и уменьшения располагаются справа."
      },
      "api": {
        "height": "Высота числового поля ввода.",
        "fill": "Булево значение, позволяющее полю заполнить контейнер.",
        "disabled": "Булево значение, отключающее поле ввода.",
        "model-value": "Текущее значение числового поля ввода.",
        "max": "Максимально допустимое значение.",
        "min": "Минимально допустимое значение.",
        "step": "Шаг для увеличения или уменьшения значения.",
        "action-btn-position-right": "Располагает кнопки действия справа, если установлено в *true*."
      },
      "slot": {},
      "variables": {},
      "exposes": {
        "inputDOMRef": "Оригинальный элемент DOM поля ввода"
      },
      "events": {
        "update:model-value": "Эмитируется при изменении значения числового поля ввода."
      }
    },
    "select": {
      "height": {
        "subtitle": "Устанавливает высоту выпадающего списка."
      },
      "fill": {
        "subtitle": "Если установлено в *true*, компонент выбора заполнит доступную ширину контейнера."
      },
      "disabled": {
        "subtitle": "Отключает компонент выбора, если установлено в *true*."
      },
      "no-element-placeholder": {
        "subtitle": "Текст, отображаемый, когда нет доступных опций для выбора."
      },
      "value-required": {
        "subtitle": "Указывает, что значение должно быть выбрано перед продолжением."
      },
      "options": {
        "subtitle": "Определяет список опций для выбора."
      },
      "options-map": {
        "subtitle": "Задает объект для отображения опций с метками и значениями."
      },
      "model-value": {
        "subtitle": "Представляет выбранное значение компонента выбора.",
        "multiple": "Несколько значений"
      },
      "loading": {
        "subtitle": "Отображает индикатор загрузки, если установлено в *true*."
      },
      "open": {
        "subtitle": "Контролирует, открыт ли выпадающий список."
      },
      "api": {
        "height": "Высота выпадающего списка.",
        "fill": "Булево значение, позволяющее списку заполнить контейнер.",
        "disabled": "Отключает выпадающий список.",
        "no-element-placeholder": "Текст-заполнитель, отображаемый, когда опции недоступны.",
        "value-required": "Требует выбора значения.",
        "options": "Список доступных опций.",
        "options-map": "Объект для отображения опций.",
        "model-value": "Выбранное значение выпадающего списка.",
        "loading": "Отображает состояние загрузки.",
        "open": "Булево значение для управления видимостью списка."
      },
      "slot": {
        "default": "Слот для настройки опций в выпадающем списке."
      },
      "variables": {
        "base-width": "Задает базовую ширину для компонента выбора."
      },
      "events": {
        "update:model-value": "Эмитируется при изменении выбранного значения."
      }
    },
    "select-option": {
      "api": {
        "label": "Определяет метку для опции, которая отображается в выпадающем списке.",
        "height": "Задает высоту опции выбора.",
        "disabled": "Булево значение, которое указывает, отключена ли опция и не может быть выбрана."
      },
      "slot": {
        "default": "Слот для настройки отображаемого контента для этой опции."
      },
      "variables": {
        "hover-bg": "Устанавливает цвет фона при наведении на опцию.",
        "hover-color": "Определяет цвет текста при наведении на опцию."
      },
      "events": {
        "change-value": "Эмитируется при изменении значения опции."
      }
    },
    "slider": {
      "fill": {
        "subtitle": "Если установлено в *true*, трек слайдера заполнит контейнер."
      },
      "disabled": {
        "subtitle": "Отключает слайдер, если установлено в *true*."
      },
      "model-value": {
        "subtitle": "Представляет текущее значение слайдера."
      },
      "max": {
        "subtitle": "Задает максимальное значение для слайдера."
      },
      "min": {
        "subtitle": "Задает минимальное значение для слайдера."
      },
      "step": {
        "subtitle": "Определяет шаг для изменения значения слайдера."
      },
      "show-tooltip": {
        "subtitle": "Если установлено в *true*, отображает всплывающую подсказку с текущим значением."
      },
      "api": {
        "fill": "Булево значение, позволяющее слайдеру заполнить контейнер.",
        "disabled": "Отключает компонент слайдера.",
        "model-value": "Текущее значение слайдера.",
        "max": "Максимальное значение для слайдера.",
        "min": "Минимальное значение для слайдера.",
        "step": "Шаг для увеличения или уменьшения значения.",
        "show-tooltip": "Булево значение для управления видимостью всплывающей подсказки."
      },
      "slot": {},
      "variables": {
        "slider-height": "Определяет высоту слайдера.",
        "value-fixed-container-height": "Устанавливает высоту контейнера для отображения значения."
      },
      "events": {
        "update:model-value": "Эмитируется при изменении значения слайдера."
      }
    },
    "radio": {
      "basic-usage": {
        "info": {
          "title": "Использование Radio Group",
          "content": "Обычно используется в группе радиокнопок, чтобы позволить пользователю выбрать один вариант из набора. После выбора радиокнопки она не может быть отменена повторным нажатием—только путем выбора другой радиокнопки в группе для изменения состояния. Для правильного отображения, при использовании 'style-type' как 'button', следует предоставить метку (label)."
        }
      },
      "api": {
        "disabled": "Булево значение, отключающее радиокнопку.",
        "label": "Текст метки, отображаемый рядом с радиокнопкой.",
        "value": "Значение, присвоенное радиокнопке.",
        "style-type": "Определяет визуальный стиль радиокнопки.",
        "checked": "Отметить радиокнопку как выбранную"
      },
      "slot": {
        "label": "Слот для настройки метки радиокнопки."
      },
      "variables": {
        "size": "Задает размер радиокнопки."
      },
      "exposes": {
        "inputDOMRef": "Оригинальный элемент DOM поля ввода"
      }
    },
    "radio-group": {
      "height": {
        "subtitle": "Определяет высоту контейнера группы радиокнопок."
      },
      "fill": {
        "subtitle": "Если установлено в *true*, группа радиокнопок займет все доступное пространство контейнера."
      },
      "disabled": {
        "subtitle": "Отключает все радиокнопки в группе, если установлено в *true*."
      },
      "model-value": {
        "subtitle": "Представляет выбранное значение в группе радиокнопок."
      },
      "options": {
        "subtitle": "Определяет список доступных для выбора опций."
      },
      "style-type": {
        "subtitle": "Определяет визуальный стиль радиокнопок в группе."
      },
      "direction": {
        "subtitle": "Устанавливает направление радиокнопок: горизонтальное или вертикальное."
      },
      "api": {
        "height": "Высота контейнера группы радиокнопок.",
        "fill": "Булево значение, позволяющее группе заполнить контейнер.",
        "disabled": "Отключает все радиокнопки в группе.",
        "model-value": "Выбранное значение группы радиокнопок.",
        "options": "Список опций для выбора.",
        "style-type": "Визуальный стиль радиокнопок.",
        "direction": "Направление расположения радиокнопок."
      },
      "slot": {
        "default": "Слот для настройки радиокнопок в группе."
      },
      "variables": {},
      "events": {
        "update:model-value": "Эмитируется при изменении выбранного значения."
      }
    },
    "form": {
      "basic-usage": {
        "subtitle": "Представляет значения формы для всех элементов ввода.",
        "too-short": "Слишком коротко",
        "wrong-age": "Неверный возраст",
        "wrong-sex": "Неправильно",
        "you-cant-be-a-nobody": "Вы не можете быть пользователем",
        "we-dont-have-kombucha": "У нас нет Комбучи(",
        "ie-not-supported": "IE не поддерживается",
        "you-must-set-agreement": "Вы должны принять соглашение",
        "value-must-greater-than-30": "Значение должно быть больше 30",
        "value-must-less-than-80": "Значение должно быть меньше 80",
        "pear-is-not-available": "Груша недоступна",
        "coffee": "Кофе",
        "tea": "Чай",
        "pear": "Груша",
        "apple": "Яблоко",
        "orange": "Апельсин",
        "unknown": "Неизвестно",
        "username": "Имя пользователя",
        "years-old": "Лет",
        "preferred-drink": "Предпочитаемый напиток",
        "browsers": "Браузеры",
        "agreement": "Соглашение",
        "number-value": "Числовое значение",
        "choose-date": "Выберите дату",
        "food": "Еда",
        "favorite-food": "Любимая еда",
        "photo": "Фото",
        "send-form": "Отправить форму",
        "enter-username": "Введите имя пользователя",
        "is-valid": "Форма валидна: ",
        "info": {
          "title": "Информация о типизации",
          "content": "Для обеспечения правильной типизации необходимо импортировать тип INmorphFromDataExpose."
        }
      },
      "validate-immediately": {
        "subtitle": "Если установлено в *true*, форма будет проверять свои поля сразу после рендеринга."
      },
      "api": {
        "value": "Значения формы для элементов ввода.",
        "validate-immediately": "Булево значение, управляющее проверкой при загрузке."
      },
      "slot": {
        "default": "Слот для настройки содержимого формы."
      },
      "variables": {},
      "exposes": {
        "form-data": "Эмитируется при валидации формы."
      },
      "explanation": `
        <div class="container">
          <h2>1. Типы правил</h2>
          <p>
            Вы можете определить правила валидации в зависимости от типа значения, которое хотите проверить:
          </p>

          <h3>Валидация текста:</h3>
          <p>
            <strong>Свойства правила:</strong> <code>pattern</code> (использует регулярные выражения), <code>error</code>
          </p>

          <h3>Валидация чисел:</h3>
          <p>
            <strong>Свойства правила:</strong> <code>numberCompareType</code> (использует <code>NmorphNumberCompareOperator</code>), <code>compareValue</code>, <code>error</code>
          </p>

          <h3>Валидация булевых значений (радиокнопка):</h3>
          <p>
            <strong>Свойства правила:</strong> <code>booleanCompareType</code> (использует <code>NmorphBooleanCompareOperator</code>), <code>compareValue</code>, <code>error</code>
          </p>

          <h3>Валидация массивов (группа чекбоксов):</h3>
          <p>
            <strong>Свойства правила:</strong> <code>arrayCompareType</code> (использует <code>NmorphArrayValidationOperator</code>), <code>compareValue</code>, <code>error</code>
          </p>

          <h2>2. Определение перечислений (Enum)</h2>
          <p>
            Следующие перечисления используются для определения различных типов операторов валидации:
          </p>

          <h3>NmorphArrayValidationOperator:</h3>
          <ul>
            <li>
              <strong>contains-one:</strong> Массив должен содержать хотя бы одно из указанных значений.
            </li>
            <li>
              <strong>not-contains:</strong> Массив не должен содержать ни одного из указанных значений.
            </li>
            <li>
              <strong>full-eq:</strong> Массив должен быть равен указанным значениям, включая порядок и длину.
            </li>
          </ul>

          <h3>NmorphNumberCompareOperator:</h3>
          <ul>
            <li>
              <strong>eq:</strong> Значение должно быть равно указанному значению.
            </li>
            <li>
              <strong>gte:</strong> Значение должно быть больше или равно указанному значению.
            </li>
            <li>
              <strong>lte:</strong> Значение должно быть меньше или равно указанному значению.
            </li>
            <li>
              <strong>gt:</strong> Значение должно быть больше указанного значения.
            </li>
            <li>
              <strong>lt:</strong> Значение должно быть меньше указанного значения.
            </li>
          </ul>

          <h3>NmorphBooleanCompareOperator:</h3>
          <ul>
            <li>
              <strong>eq:</strong> Булево значение должно быть равно указанному значению.
            </li>
            <li>
              <strong>not-eq:</strong> Булево значение не должно быть равно указанному значению.
            </li>
          </ul>

          <h2>3. Доступ к состоянию валидации</h2>
          <p>
            После вызова функции <code>useFieldValidation</code>, вам будут доступны следующие параметры:
          </p>
          <ul>
            <li>
              <strong>touched:</strong> Указывает, было ли поле затронуто.
            </li>
            <li>
              <strong>valid:</strong> Указывает, является ли поле допустимым на основе определенных правил.
            </li>
            <li>
              <strong>errors:</strong> Массив, содержащий сообщения об ошибках для поля.
            </li>
            <li>
              <strong>validate:</strong> Функция, которая запускает процесс валидации.
            </li>
          </ul>
        </div>
      `
    },
    "form-item": {
      "api": {
        "id": "Уникальный идентификатор для элемента формы.",
        "height": "Устанавливает высоту контейнера элемента формы.",
        "label": "Определяет текст метки, связанный с элементом формы, предоставляя контекст пользователю.",
        "show-validation-icon": "Булево значение, управляющее отображением иконки валидации для данного элемента формы.",
        "static-error-box-space": "Определяет статическое пространство для отображения поля ошибки, обеспечивая единообразие пространства независимо от состояния валидации.",
        "validate": "Определяет правила валидации для элемента формы."
      },
      "slot": {
        "default": "Слот для настройки содержимого элемента формы, обычно включает элементы ввода или другие элементы управления формой."
      }
    },
    "date-picker": {
      "height": {
        "subtitle": "Устанавливает высоту поля выбора даты."
      },
      "disabled": {
        "subtitle": "Отключает выбор даты, если установлено в *true*."
      },
      "api": {
        "height": "Высота поля выбора даты.",
        "disabled": "Булево значение, отключающее выбор даты.",
        "placeholder": "Текст, отображаемый, когда дата не выбрана.",
        "model-value": "Текущая выбранная дата или диапазон дат.",
        "type": "Тип выбора даты, например, *одиночный* или *диапазон*.",
        "text-separator": "Текст для разделения начальной и конечной дат в режиме выбора диапазона."
      },
      "slot": {},
      "variables": {
        "width": "Определяет ширину компонента выбора даты."
      },
      "events": {
        "update:model-value": "Эмитируется, когда выбранная дата или диапазон дат изменяются."
      }
    }
  }
};
